Autodesk.Revit.DB.ExternalResourceReferenceDebugModes.DumpMessage(System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Dump logs to journals, dump file, std out.
message:
The message
bOutputToScreen:
The dumps to output screen, if true.
bOutputToStdFile:
The dumps to standard file, if true.
bOutputToJournal:
The dumps to journal file, if true.
timeStamp:
Prepend time stamp to the message.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.ExternalResourceReferenceDebugModes.UseVersionFromDesktopConnector
Resource will use the version from desktop connector instead of file timestamp.
Returns:
True to use.
Since:
2018

Autodesk.Revit.DB.ExternalResourceReferenceDebugModes.PostDebugWarnMessage(System.String,System.String,System.String)
Post debug warning message from internal API code
message:
The message
owner:
The owner
date:
The date
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018